export const artistData = [
	{
		id: "1",
		name: "NANIPILINA Hulastudio/Mino'aka Hula studio",
		image: ["/assets/artist/1/1.jpg"],
		imgClass: "object-[0%_10%]",
		description: `みなさんAloha!!
ハワイ語でNANIは美しい、PILINAは絆という意味があります!!美しい絆を持ったお仲間と沢山の人を笑顔にhappyに出来たらと思っています！
そして今回はMino'aka Hula studioさんとコラボレーションさせて頂きます!!素敵なお時間に出来るよう頑張ります!!
	`,
		schedule: {
			day: ["＜8月11日(日)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
		sns: {},
	},
	{
		id: "2",
		name: "ハーラウカピオオカプアレフア",
		image: ["/assets/artist/2/1.jpg"],
		imgClass: "object-[0%_30%]",
		description:
			"ハワイの文化を正しく学び継承していくことに力を注ぎ、ナチュラルかつ謙虚な気持ちで、幅広い年代の生徒が楽しみながら踊っています。また、地域のイベントや福祉活動をはじめ、多くのイベントに出演しています。",
		schedule: {
			day: ["＜8月4日(日)＞"],
			time: ["１８：3０〜"],
		},
		sns: {},
	},
	// 	{
	// 		id: "3",
	// 		name: "Hālau Nālikookapalai(ハーラウ ナーリコオカパライ)",
	// 		image: ["/assets/artist/3/1.jpg"],
	// 		description: `湘南で活動するフラチームです。
	// カラカウア王の宮廷フラダンサーを曽祖母に持つハワイアンの師匠の教えのもと、古典フラ、現代フラ、ハワイアンカルチャーを楽しく学んでいます。`,
	// 		schedule: {
	// 			day: ["＜8月11日(日)＞"],
	// 			time: ["１８：００〜、１９：３０〜"],
	// 		},
	// 		sns: {},
	// 	},
	{
		id: "4",
		name: "Kealiʻiokalani 剛 Kalima",
		image: [
			"/assets/artist/4/4.Kealiʻiokalani 剛 Kalima(1).jpg",
			"/assets/artist/4/4.Kealiʻiokalani 剛 Kalima(2).jpg",
		],
		imgClass: "object-[0%_5%]",
		description: `東京都出身
2016年 ハワイ カメハメハ ハイスクール コンサートグリークラブでケアウホウのザック ラム氏に指導を受ける
2017年 同クラブ内でハワイアン グループ「オーラウニウ」を結成
2018年 ミュージック テッククラスにて 作成したCDアルバム「Untold」がナホク ハノハノ ミュージック アワードにノミネートされる
2022年 ハワイ大学(音楽専攻)を卒業
現在 様々なイベント、コンサートに出演、ウクレレクラスを持ち指導、生徒の出演もサポートしている`,
		schedule: {
			day: ["＜7月20日(土)、7月21日(日)、7月27日(土)、7月28日(日)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
		sns: {},
	},
	{
		id: "5",
		name: "Kekai Ah Puck",
		image: ["/assets/artist/4/4.Kekai Ah Puck.jpg"],
		description:
			"1986年生まれ。学生時代には全ての学年でハワイアンクラスを受講。フラ・タヒチアンのダンサーであるとともに、タヒチアンドラム(トエレ)、ウクレレ、ノーズフルートなどの楽器も使いこなし、ミュージシャンとしても活躍。亡き祖母の後を継ぎ、Lauhala Weavingでブレスレットなどアクセサリーの製作を行なっている。マウイのルアウ・ショー「Old Lahaina Luau」に出演していたプロダンサーであり、プロミュージシャン。",
		schedule: {
			day: ["＜7月20日(土)、7月21日(日)、7月28日(日)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
		sns: {},
	},
	{
		id: "6",
		name: "日下貴博 -Taka-",
		image: ["/assets/artist/4/4.日下貴博 -Taka-.jpg"],
		description: `1973年8月13日生まれ
横浜出身
2005年頃よりハワイの美しさと音楽の素晴らしさに触れウクレレを始める。
ハワイの音楽の先生の下でウクレレと歌を学び2010年頃より本格的に演奏活動を始める。
ハワイオアフ島でのライブを経験し現地のハワイミュージシャンとも多くの交流を持つ。
現在は山形、仙台、宇都宮、群馬、東京、横浜、浜松、名古屋、沖縄にウクレレの教室を持ちその他の地域にはウクレレのワークショップ講師としてウクレレのハワイアンの演奏方法を伝えている。
演奏活動としては、全国各地でのライブ、フラの教室の発表会、フラの大会の演奏、ホテルなどのハワイアンフェスティバルの演奏、各地のイベントでの演奏を行う。
ハワイ現地のミュージシャンからのバックアップも行う`,
		schedule: {
			day: ["＜7月27日(土)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
		sns: {},
	},
];

export const artistData2 = [
	{
		id: "1",
		name: "Tento",
		description: "",
		schedule: {
			day: [
				"＜7月22日(月)、7月24日(水)、8月1日(木)、8月5日(月)、8月7日(水)、8月14日(水)、8月16日(金)＞",
			],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
	{
		id: "2",
		name: " KAZU",
		description: "",
		schedule: {
			day: ["＜7月25日(木)、7月29日(月)、8月15日(木)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
	{
		id: "3",
		name: "あお",
		description: "",
		schedule: {
			day: ["＜7月26日(金)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
	{
		id: "4",
		name: "FALCON",
		description: "",
		schedule: {
			day: ["＜7月29日(月)、7月31日(水)、8月13日(火)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
	{
		id: "5",
		name: "ドラマチックガマン",
		description: "",
		schedule: {
			day: ["＜8月2日(金)、8月8日(木)、8月9日(金)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
	{
		id: "6",
		name: "ワンダフルワンダー",
		description: "",
		schedule: {
			day: ["＜8月6日(火)＞"],
			time: ["１８：００〜、１９：３０〜"],
		},
	},
];

export const CollaboData = [
	{
		id: "1",
		name: "アーティスト名",
		image: ["/assets/common/sample.png"],
		description:
			"ここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入ります",
		schedule: {
			day: [],
			time: [],
		},
		sns: {},
	},
	{
		id: "2",
		name: "アーティスト名",
		image: ["/assets/common/sample.png"],
		description:
			"ここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入りますここにテキストが入ります",
		schedule: {
			day: [],
			time: [],
		},
		sns: {},
	},
];
